----------------------------------------------------------------------------------------
-- [1] NUMERIC, DECIMAL 데이터타입(수)
----------------------------------------------------------------------------------------
-- CONVERT 함수와 함께 사용하는 것에 대해서 숙지, (문자 --> 숫자 변환)
-- 소숫점 이하에서 반올림, 지정도 가능.
SELECT CONVERT(INT, '1234') AS 정수,
	   CONVERT(FLOAT, '1234.56') AS '실수(부동소수점)',
	   CONVERT(NUMERIC, '1234.5678') AS 실수,
	   CONVERT(DECIMAL, '1234.5678') AS 실수,
	   CONVERT(NUMERIC(6,2) , '1234.5678') AS 'NUMERIC(8,3)', -- (전체자릿수, 소수점 이하 자릿수)
	   CONVERT(DECIMAL(8,3), '1234.5678') AS 'DECIMAL(8,3)'

----------------------------------------------------------------------------------------
-- [2] MONEY, DECIMAL 데이터타입
----------------------------------------------------------------------------------------
-- 세자리 마다 콤마를 찍어주기 위해서는 MONEY로 지정하거나 또는 MONEY로 컨버팅.
-- 타입이 VARCHAR라도 숫자 포맷이면 변환이 가능.
-- 예)
SELECT (123456789)
SELECT CONVERT(MONEY,123456789);
SELECT CONVERT(DECIMAL(12,2),123456789);
SELECT CONVERT(VARCHAR, CONVERT(MONEY,123456789), 1);
SELECT REPLACE( CONVERT(VARCHAR, CONVERT(MONEY,123456789), 1), '.00', ''); -- REPLACE 이용












