// 다음은 클래스 작성시 주의할 사항인데 이중 틀린 것을 말해보시오.
// 이 문제는 여러 클래스 작성시 주의할 점에 대해서 알고 있는지를 묻는 문제이다.


// (1) 하나의 파일에 2개 이상의 클래스를 작성할 수 있다. 
// (2) 3개의 클래스가 있다면 자바 파일명이 될 수 있는 것은 public 키워드가 붙은 클래스이다.
// (3) 하나의 파일에 있는 3개의 클래스에 모두 public 키워드를 붙일 수 있다.
// (4) 한 파일내 3개 이상의 클래스에 모두 public 키워드를 안붙일 수 있다.
// (5) 한 파일내 3개 이상의 클래스에 모두 public 키워드가 없다면 클래스중 어느 것이라도 파일명이 될 수 있다.
// (6) 자바 파일에 클래스가 한개 있다면 클래스명이 곧 파일명이 되어야 한다.


class A {
	
}
class B {
	
}
public class Java100_oop_Exam004 {
	public static void main(String[] args) {  }
}

